yelp_clone/app/controllers/restaurants_controller.rb

INSERT INTO "restaurants" ("name", "created_at", "updated_at") VALUES ($1, $2, $3) RETURNING "id"  [["name", "Waffle House"], ["created_at", "2016-11-15 15:37:28.106774"], ["updated_at", "2016-11-15 15:37:28.106774"]]
---
  def create
    # raise params.inspect
    @restaurant = Restaurant.new(restaurant_params)
    if @restaurant.save

SELECT  "restaurants".* FROM "restaurants" WHERE "restaurants"."id" = $1 LIMIT 1  [["id", 2]]
UPDATE "restaurants" SET "description" = $1, "updated_at" = $2 WHERE "restaurants"."id" = $3  [["description", "Great eats, cool treats."], ["updated_at", "2016-11-15 16:13:29.482883"], ["id", 2]]
---
def update
    @restaurant = Restaurant.find(params[:id])
    @restaurant.update(restaurant_params)